driver-tests/httpsoapbc/dynamicURL/GETCA/test/TestCase2/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:pl="http://j2ee.netbeans.org/wsdl/GETBP/pl" 
xmlns:add="http://schemas.xmlsoap.org/ws/2004/08/addressing"
>
  <soapenv:Body>
    <pl:plOperation>
      <part1>289</part1>
      <part2>
        <add:EndpointReference xmlns:tns="http://j2ee.netbeans.org/wsdl/GETBP/get">
          <add:Address>http://www.sedlabanki.is</add:Address>
          
          <add:ServiceName PortName="getPort">tns:getService</add:ServiceName>
         
        </add:EndpointReference>
      </part2>
    </pl:plOperation>
  </soapenv:Body>
</soapenv:Envelope>